In [1]:
# https://www.dataquest.io/blog/python-pandas-databases/
import sqlite3
conn = sqlite3.connect("flights.db")
cur = conn.cursor()

In [2]:
# Listing all the tables in the database
get_tables = cur.execute('SELECT name FROM sqlite_master WHERE type = "table"')
for table in list(get_tables):
    print table

(u'airports',)
(u'airlines',)
(u'routes',)

In [3]:
airports_df = cur.execute("SELECT * FROM airports LIMIT 5")
for row in airports_df.fetchall():
    print row

(0, u'1', u'Goroka', u'Goroka', u'Papua New Guinea', u'GKA', u'AYGA', u'-6.081689', u'145.391881', u'5282', u'10', u'U', u'Pacific/Port_Moresby')
(1, u'2', u'Madang', u'Madang', u'Papua New Guinea', u'MAG', u'AYMD', u'-5.207083', u'145.7887', u'20', u'10', u'U', u'Pacific/Port_Moresby')
(2, u'3', u'Mount Hagen', u'Mount Hagen', u'Papua New Guinea', u'HGU', u'AYMH', u'-5.826789', u'144.295861', u'5388', u'10', u'U', u'Pacific/Port_Moresby')
(3, u'4', u'Nadzab', u'Nadzab', u'Papua New Guinea', u'LAE', u'AYNZ', u'-6.569828', u'146.726242', u'239', u'10', u'U', u'Pacific/Port_Moresby')
(4, u'5', u'Port Moresby Jacksons Intl', u'Port Moresby', u'Papua New Guinea', u'POM', u'AYPY', u'-9.443383', u'147.22005', u'146', u'10', u'U', u'Pacific/Port_Moresby')

In [4]:
cur.close()
conn.close()

In [5]:
import sqlite3
conn = sqlite3.connect("flights.db")
cur = conn.cursor()
coords = cur.execute("""
  select cast(longitude as float), 
  cast(latitude as float) 
  from airports;"""
).fetchall()
# print coords

In [6]:
import pandas as pd
df = pd.read_sql_query("SELECT * FROM airlines LIMIT 5;", conn)

In [7]:
df['country']

0              None
1     United States
2      South Africa
3    United Kingdom
4            Russia
Name: country, dtype: object

In [8]:
routes = pd.read_sql_query("""
                           select cast(sa.longitude as float) as source_lon, 
                           cast(sa.latitude as float) as source_lat,
                           cast(da.longitude as float) as dest_lon,
                           cast(da.latitude as float) as dest_lat
                           from routes 
                           inner join airports sa on
                           sa.id = routes.source_id
                           inner join airports da on
                           da.id = routes.dest_id;
                           """, 
                           conn)

In [9]:
print routes.head()

   source_lon  source_lat   dest_lon   dest_lat
0   39.956589   43.449928  49.278728  55.606186
1   48.006278   46.283333  49.278728  55.606186
2   48.006278   46.283333  43.081889  44.225072
3   61.503333   55.305836  49.278728  55.606186
4   61.503333   55.305836  82.650656  55.012622

In [10]:
airlines = cur.execute("SELECT * FROM airlines;")
# print airlines.fetchall()

In [11]:
# Inserting a row into airlines table
cur.execute("INSERT INTO airlines VALUES (6048, 19846, 'Test flight', '', '', null, null, null, 'Y')")

In [12]:
conn.commit()

In [13]:
df  = pd.read_sql_query("SELECT * FROM airlines WHERE ID = 19846;", conn)
df

   index     id         name alias iata  icao callsign country active
0   6048  19846  Test flight             None     None    None      Y

In [14]:
values = ('Test Flight', 'Y')
cur.execute("INSERT INTO airlines VALUES (6049, 19847, ?, '', '', null, null, null, ?)", values)
conn.commit()

In [15]:
values = ('USA', 19847)
cur.execute("UPDATE airlines SET country=? where id=?", values)
conn.commit()

In [16]:
pd.read_sql_query("SELECT * FROM airlines WHERE id=19847;", conn)

   index     id         name alias iata  icao callsign country active
0   6049  19847  Test Flight             None     None     USA      Y

In [17]:
# Create a table
cur.execute("CREATE TABLE daily_flights (id integer, departure date, arrival date, number text, route_id integer)")

In [18]:
cur.execute("INSERT INTO daily_flights VALUES (1, '2016-09-28 0:00', '2016-09-28 12:00', 'T1', 1)")
conn.commit()

In [19]:
pd.read_sql_query("SELECT * FROM daily_flights;", conn)

   id        departure           arrival number  route_id
0   1  2016-09-28 0:00  2016-09-28 12:00     T1         1

In [20]:
# Create a pandas dataframe
from datetime import datetime
df = pd.DataFrame(
    [[1, datetime(2016, 9, 29, 0, 0) , datetime(2016, 9, 29, 12, 0), 'T1', 1]], 
    columns=["id", "departure", "arrival", "number", "route_id"]
)

In [21]:
df.to_sql("daily_flights", conn, if_exists="replace", index=False)

In [22]:
pd.read_sql_query("SELECT * FROM daily_flights;", conn)

   id            departure              arrival number  route_id
0   1  2016-09-29 00:00:00  2016-09-29 12:00:00     T1         1

In [23]:
cur.execute("ALTER TABLE airlines ADD COLUMN airplanes integer;")

In [24]:
df = pd.read_sql("SELECT * FROM daily_flights", conn)
df["delay_minutes"] = None
df.to_sql("daily_flights", conn, if_exists="replace", index=False)

In [25]:
conn.commit()

In [26]:
conn.close()